devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
/*=========================================================================*//**
@file    sdspi.c

@author  Daniel Zorychta

@brief   This file support SD in SPI mode

@note    Copyright (C) 2013 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "core/module.h"
#include <dnx/thread.h>
#include <dnx/os.h>
#include <dnx/timer.h>
#include <dnx/misc.h>
#include <unistd.h>
#include "stm32f1/sdspi_cfg.h"
#include "stm32f1/sdspi_def.h"
#include "stm32f1/stm32f10x.h"

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
#define MTX_BLOCK_TIME                                  0
#define MTX_BLOCK_TIME_LONG                             200
#define RELEASE_TIMEOUT_MS                              1000

/* card command definitions */ /* create as enum sdcmd_t */
#define CMD0                                            (0x40+0 )       /* GO_IDLE_STATE */
#define CMD1                                            (0x40+1 )       /* SEND_OP_COND (MMC) */
#define ACMD41                                          (0xC0+41)       /* SEND_OP_COND (SDC) */
#define CMD8                                            (0x40+8 )       /* SEND_IF_COND */
#define CMD9                                            (0x40+9 )       /* SEND_CSD */
#define CMD10                                           (0x40+10)       /* SEND_CID */
#define CMD12                                           (0x40+12)       /* STOP_TRANSMISSION */
#define ACMD13                                          (0xC0+13)       /* SD_STATUS (SDC) */
#define CMD16                                           (0x40+16)       /* SET_BLOCKLEN */
#define CMD17                                           (0x40+17)       /* READ_SINGLE_BLOCK */
#define CMD18                                           (0x40+18)       /* READ_MULTIPLE_BLOCK */
#define CMD23                                           (0x40+23)       /* SET_BLOCK_COUNT (MMC) */
#define ACMD23                                          (0xC0+23)       /* SET_WR_BLK_ERASE_COUNT (SDC) */
#define CMD24                                           (0x40+24)       /* WRITE_BLOCK */
#define CMD25                                           (0x40+25)       /* WRITE_MULTIPLE_BLOCK */
#define CMD55                                           (0x40+55)       /* APP_CMD */
#define CMD58                                           (0x40+58)       /* READ_OCR */

/* card type flags */ /* create as struct card_type_t */
#define CT_MMC                                          (1 << 0)
#define CT_SD1                                          (1 << 1)
#define CT_SD2                                          (1 << 2)
#define CT_SDC                                          (CT_SD1|CT_SD2)
#define CT_BLOCK                                        (1 << 3)

#define SECTOR_SIZE                                     512

/* MBR definitions */
#define MBR_BOOTSTRAP_CODE_OFFSET                       0x000
#define MBR_PARTITION_1_ENTRY_OFFSET                    0x1BE
#define MBR_PARTITION_2_ENTRY_OFFSET                    0x1CE
#define MBR_PARTITION_3_ENTRY_OFFSET                    0x1DE
#define MBR_PARTITION_4_ENTRY_OFFSET                    0x1EE
#define MBR_BOOT_SIGNATURE_OFFSET                       0x1FE

#define MBR_PARITION_ENTRY_STATUS_OFFSET                0x00
#define MBR_PARITION_ENTRY_CHS_FIRST_ADDR_OFFSET        0x01
#define MBR_PARITION_ENTRY_PARTITION_TYPE_OFFSET        0x04
#define MBR_PARITION_ENTRY_CHS_LAST_ADDR_OFFSET         0x05
#define MBR_PARITION_ENTRY_LBA_FIRST_ADDR_OFFSET        0x08
#define MBR_PARITION_ENTRY_NUM_OF_SECTORS_OFFSET        0x0C

/*==============================================================================
  Local types, enums definitions
==============================================================================*/
/** card types */
typedef u8_t card_type; /* to struct */

/** device structure */
typedef struct {
        u32_t           first_sector;   /* sector number              */
        u32_t           size;           /* in sectors                 */
        bool            used;           /* true if part used          */
        u8_t            major;          /* device major number        */
        u8_t            minor;          /* device minor number        */
} sdpart_t;

/** main control structure */
typedef struct {
        mutex_t        *card_protect_mtx;
        sdpart_t       *part[5];
        card_type       card_type;
        bool            card_initialized;
#if (SDSPI_ENABLE_DMA != 0)
        volatile bool   DMA_tansaction_finished;
#endif
} sdctrl_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
static stdret_t         spi_turn_on_clock                       (void);
static stdret_t         spi_turn_off_clock                      (void);
static void             spi_configure                           (void);
static void             spi_select_card                         (void);
static void             spi_deselect_card                       (void);
static void             spi_configure_DMA                       (bool enable);
static void             spi_enable_Tx_Rx_DMA                    (void);
static void             spi_disable_Tx_Rx_DMA                   (void);
static bool             spi_is_rx_buffer_not_empty              (void);
static void             spi_send_data                           (u8_t data);
static u8_t             spi_get_data                            (void);
static u8_t             spi_transmit                            (u8_t out);
static u8_t             card_send_cmd                           (sdpart_t *hdl, u8_t cmd, u32_t arg);
static u8_t             card_wait_ready                         (void);
static bool             card_receive_data_block                 (u8_t *buff);
static bool             card_transmit_data_block                (const u8_t *buff, u8_t token);
static ssize_t          card_read_whole_sectors                 (sdpart_t *hdl, void *dst, size_t nsectors, u64_t lseek);
static ssize_t          card_read_partial_sectors               (sdpart_t *hdl, void *dst, size_t size, u64_t lseek);
static ssize_t          card_write_whole_sectors                (sdpart_t *hdl, const void *src, size_t nsectors, u64_t lseek);
static ssize_t          card_write_partial_sectors              (sdpart_t *hdl, const void *src, size_t size, u64_t lseek);
static stdret_t         card_initialize                         (sdpart_t *hdl);
static ssize_t          card_read                               (sdpart_t *hdl, u8_t *dst, size_t count, u64_t lseek);
static ssize_t          card_write                              (sdpart_t *hdl, const u8_t *src, size_t count, u64_t lseek);
static u16_t            mbr_get_boot_signature                  (u8_t *sector);
static u32_t            mbr_get_partition_first_LBA_sector      (int partition, u8_t *sector);
static u32_t            mbr_get_partition_number_of_sectors     (int partition, u8_t *sector);
static stdret_t         mbr_detect_partitions                   (sdpart_t *hdl);

/*==============================================================================
  Local object definitions
==============================================================================*/
static sdctrl_t *sdspi_ctrl;

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_INIT(SDSPI, void **device_handle, u8_t major, u8_t minor)
{
        STOP_IF(device_handle == NULL);

