devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
        if (major != _SDSPI_CARD_0 || minor > _SDSPI_PARTITION_4) {
                errno = EINVAL;
                return STD_RET_ERROR;
        }

        if (sdspi_ctrl == NULL) {
                sdctrl_t *sdspi = calloc(1, sizeof(sdctrl_t));
                mutex_t  *mtx   = mutex_new(MUTEX_NORMAL);

                if (sdspi && mtx) {
                        spi_turn_on_clock();
                        spi_configure();
                        spi_configure_DMA(true);

                        sdspi->card_protect_mtx = mtx;
                        sdspi_ctrl              = sdspi;

                } else {
                        if (sdspi)
                                free(sdspi);

                        if (mtx)
                                mutex_delete(mtx);

                        return STD_RET_ERROR;
                }
        }

        if (sdspi_ctrl) {
                sdpart_t *part = calloc(1, sizeof(sdpart_t));
                if (part) {
                        part->first_sector      = 0;
                        part->size              = 0;
                        part->major             = major;
                        part->minor             = minor;

                        sdspi_ctrl->part[minor] = part;

                        *device_handle          = part;

                        return STD_RET_OK;
                }
        }

        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_RELEASE(SDSPI, void *device_handle)
{
        STOP_IF(device_handle == NULL);

        sdpart_t *part = device_handle;

        timer_t timer = timer_reset();
        while (part->used) {
                if (timer_is_expired(timer, RELEASE_TIMEOUT_MS)) {
                        errno = EBUSY;
                        return STD_RET_ERROR;
                }

                sleep_ms(10);
        }

        critical_section_begin();
        sdspi_ctrl->part[part->minor] = NULL;

        part->first_sector = 0;
        part->size         = 0;
        part->used         = false;
        part->minor        = 0;

        free(part);

        if (  sdspi_ctrl->part[_SDSPI_FULL_VOLUME] == NULL
           && sdspi_ctrl->part[_SDSPI_PARTITION_1] == NULL
           && sdspi_ctrl->part[_SDSPI_PARTITION_2] == NULL
           && sdspi_ctrl->part[_SDSPI_PARTITION_3] == NULL
           && sdspi_ctrl->part[_SDSPI_PARTITION_4] == NULL  ) {

                mutex_delete(sdspi_ctrl->card_protect_mtx);
                sdspi_ctrl->card_initialized = false;
                sdspi_ctrl->card_protect_mtx = NULL;
                free(sdspi_ctrl);

                spi_turn_off_clock();
                spi_configure_DMA(false);
        }

        critical_section_end();

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_OPEN(SDSPI, void *device_handle, int flags)
{
        UNUSED_ARG(flags);
        STOP_IF(device_handle == NULL);

        sdpart_t *part = device_handle;

        if (part->used == true) {
                errno = EBUSY;
                return STD_RET_ERROR;
        } else {
                return STD_RET_OK;
        }
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_CLOSE(SDSPI, void *device_handle, bool force)
{
        UNUSED_ARG(force);
        STOP_IF(device_handle == NULL);

        sdpart_t *part = device_handle;

        part->used = false;

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[in ]           fattr                  file attributes
 *
 * @return number of written bytes, -1 if error
 */
//==============================================================================
API_MOD_WRITE(SDSPI, void *device_handle, const u8_t *src, size_t count, u64_t *fpos, struct vfs_fattr fattr)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(src == NULL);
        STOP_IF(count == 0);
        STOP_IF(fpos == NULL);
        UNUSED_ARG(fattr);

        sdpart_t *part = device_handle;

        ssize_t n = -1;
        if (part->size > 0) {
                if (mutex_lock(sdspi_ctrl->card_protect_mtx, MAX_DELAY_MS)) {
                        n = card_write(part, src, count, *fpos + ((u64_t)part->first_sector * SECTOR_SIZE));
                        mutex_unlock(sdspi_ctrl->card_protect_mtx);
                } else {
                        errno = EBUSY;
                }
        } else {
                errno = ENOMEDIUM;
        }

        return n;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[in ]           fattr                  file attributes
 *
 * @return number of read bytes, -1 if error
 */
//==============================================================================
API_MOD_READ(SDSPI, void *device_handle, u8_t *dst, size_t count, u64_t *fpos, struct vfs_fattr fattr)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(dst == NULL);
        STOP_IF(count == 0);
        STOP_IF(fpos == NULL);
        UNUSED_ARG(fattr);

        sdpart_t *part = device_handle;

        ssize_t n = -1;
        if (part->size > 0) {
                if (mutex_lock(sdspi_ctrl->card_protect_mtx, MAX_DELAY_MS)) {
                        n = card_read(part, dst, count, *fpos + ((u64_t)part->first_sector * SECTOR_SIZE));
                        mutex_unlock(sdspi_ctrl->card_protect_mtx);
                } else {
                        errno = EBUSY;
                }
        } else {
                errno = ENOMEDIUM;
        }

        return n;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_IOCTL(SDSPI, void *device_handle, int request, void *arg)
{
        STOP_IF(device_handle == NULL);

        sdpart_t *part = device_handle;

        stdret_t status = STD_RET_OK;

        switch (request) {
        case SDSPI_IORQ_INITIALIZE_CARD:
                if (mutex_lock(sdspi_ctrl->card_protect_mtx, MTX_BLOCK_TIME)) {
                        bool *result = arg;
                        *result      = false;

                        if (card_initialize(part) == STD_RET_OK) {
                                if (mbr_detect_partitions(part) == STD_RET_OK) {
                                        *result = true;
                                }
                        }

                        mutex_unlock(sdspi_ctrl->card_protect_mtx);
                } else {
                        errno  = EBUSY;
                        status = STD_RET_ERROR;
                }
                break;

        default:
                errno = EBADRQC;
                status = STD_RET_ERROR;
                break;
        }

