devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
        return status;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_FLUSH(SDSPI, void *device_handle)
{
        STOP_IF(device_handle == NULL);

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_STAT(SDSPI, void *device_handle, struct vfs_dev_stat *device_stat)
{
        STOP_IF(device_handle == NULL);
        STOP_IF(device_stat == NULL);

        sdpart_t *part = device_handle;

        if (sdspi_ctrl->card_initialized) {
                device_stat->st_major = part->major;
                device_stat->st_minor = part->minor;
                device_stat->st_size  = (u64_t)part->size * SECTOR_SIZE;

                return STD_RET_OK;
        } else {
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Function turn on SPI clock
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t spi_turn_on_clock(void)
{
        switch ((u32_t)SDSPI_PORT) {
        #if defined(RCC_APB2ENR_SPI1EN)
        case SPI1_BASE:
                RCC->APB2RSTR |=  RCC_APB2RSTR_SPI1RST;
                RCC->APB2RSTR &= ~RCC_APB2RSTR_SPI1RST;
                RCC->APB2ENR  |=  RCC_APB2ENR_SPI1EN;
                return STD_RET_OK;
        #endif
        #if defined(RCC_APB1ENR_SPI2EN)
        case SPI2_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI2RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI2RST;
                RCC->APB1ENR  |=  RCC_APB1ENR_SPI2EN;
                return STD_RET_OK;
        #endif
        #if defined(RCC_APB1ENR_SPI3EN)
        case SPI3_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI3RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI3RST;
                RCC->APB1ENR  |=  RCC_APB1ENR_SPI3EN;
                return STD_RET_OK;
        #endif
        default:
                errno = EIO;
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Function turn off SPI clock
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t spi_turn_off_clock(void)
{
        switch ((u32_t)SDSPI_PORT) {
        #if defined(RCC_APB2ENR_SPI1EN)
        case SPI1_BASE:
                RCC->APB2RSTR |=  RCC_APB2RSTR_SPI1RST;
                RCC->APB2RSTR &= ~RCC_APB2RSTR_SPI1RST;
                RCC->APB2ENR  &= ~RCC_APB2ENR_SPI1EN;
                return STD_RET_OK;
        #endif
        #if defined(RCC_APB1ENR_SPI2EN)
        case SPI2_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI2RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI2RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_SPI2EN;
                return STD_RET_OK;
        #endif
        #if defined(RCC_APB1ENR_SPI3EN)
        case SPI3_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI3RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI3RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_SPI3EN;
                return STD_RET_OK;
        #endif
        default:
                errno = EIO;
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Function configure SPI interface
 *
 * SPI configuration (Mode 0):
 * - MSB First
 * - sample on rising edge
 * - SCLK L on idle state
 * - 8-bit data
 */
//==============================================================================
static void spi_configure(void)
{
        /* enable_SS_output_in_master_mode */
        SET_BIT(SDSPI_PORT->CR2, SPI_CR2_SSOE);

        /* enable_software_slave_management */
        /* enable_master_mode */
        SET_BIT(SDSPI_PORT->CR1, SPI_CR1_SSM | SPI_CR1_MSTR);

        /* set clock divider */
        CLEAR_BIT(SDSPI_PORT->CR1, SPI_CR1_BR);
        if (SDSPI_SPI_CLOCK_DIVIDER <= 2)
                SET_BIT(SDSPI_PORT->CR1, 0);
        else if (SDSPI_SPI_CLOCK_DIVIDER <= 4)
                SET_BIT(SDSPI_PORT->CR1, SPI_CR1_BR_0);
        else if (SDSPI_SPI_CLOCK_DIVIDER <= 8)
                SET_BIT(SDSPI_PORT->CR1, SPI_CR1_BR_1);
        else if (SDSPI_SPI_CLOCK_DIVIDER <= 16)
                SET_BIT(SDSPI_PORT->CR1, SPI_CR1_BR_1 | SPI_CR1_BR_0);
        else if (SDSPI_SPI_CLOCK_DIVIDER <= 32)
                SET_BIT(SDSPI_PORT->CR1, SPI_CR1_BR_2);
        else if (SDSPI_SPI_CLOCK_DIVIDER <= 64)
                SET_BIT(SDSPI_PORT->CR1, SPI_CR1_BR_2 | SPI_CR1_BR_0);
        else if (SDSPI_SPI_CLOCK_DIVIDER <= 128)
                SET_BIT(SDSPI_PORT->CR1, SPI_CR1_BR_2 | SPI_CR1_BR_1);
        else
                SET_BIT(SDSPI_PORT->CR1, SPI_CR1_BR_2 | SPI_CR1_BR_1 | SPI_CR1_BR_0);

        SET_BIT(SDSPI_PORT->CR1, SPI_CR1_SPE);
}

//==============================================================================
/**
 * @brief Function select card
 */
//==============================================================================
static void spi_select_card(void)
{
        SDSPI_SD_SELECT;
}

//==============================================================================
/**
 * @brief Function deselect card
 */
//==============================================================================
static void spi_deselect_card(void)
{
        SDSPI_SD_DESELECT;
}

//==============================================================================
/**
 * @brief Configure DMA
 */
//==============================================================================
static void spi_configure_DMA(bool enable)
{
#if (SDSPI_ENABLE_DMA != 0)
        if (enable) {
                if ((u32_t)SDSPI_DMA == DMA1_BASE) {
                        SET_BIT(RCC->AHBENR, RCC_AHBENR_DMA1EN);
                } else if ((u32_t)SDSPI_DMA == DMA2_BASE) {
                        SET_BIT(RCC->AHBENR, RCC_AHBENR_DMA2EN);
                } else {
                        return;
                }

                NVIC_SetPriority(SDSPI_DMA_IRQ_NUMBER, SDSPI_DMA_IRQ_PRIORITY);

        } else {
                if ((u32_t)SDSPI_DMA == DMA1_BASE) {
                        CLEAR_BIT(RCC->AHBENR, RCC_AHBENR_DMA1EN);
                } else if ((u32_t)SDSPI_DMA == DMA2_BASE) {
                        CLEAR_BIT(RCC->AHBENR, RCC_AHBENR_DMA2EN);
                } else {
                        return;
                }
        }
#endif
}

//==============================================================================
/**
 * @brief Function enable Tx and Rx DMA transaction
 */
//==============================================================================
static void spi_enable_Tx_Rx_DMA(void)
{
        SET_BIT(SDSPI_PORT->CR2,SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN);
}

//==============================================================================
/**
 * @brief Function disable Tx and Rx DMA transaction
 */
//==============================================================================
static void spi_disable_Tx_Rx_DMA(void)
{
        CLEAR_BIT(SDSPI_PORT->CR2,SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN);
}

//==============================================================================
/**
 * @brief Function check if RX buffer is empty
 */
//==============================================================================
static bool spi_is_rx_buffer_not_empty(void)
{
        return (SDSPI_PORT->SR & SPI_SR_RXNE);
}

//==============================================================================
/**
 * @brief Function send data using SPI register
 *
 * @param data
 */
//==============================================================================
static void spi_send_data(u8_t data)
{
        SDSPI_PORT->DR = data;
}

//==============================================================================
/**
 * @brief Function gets data from SPI register
 *
 * @return received byte
 */
//==============================================================================
static u8_t spi_get_data(void)
{
        return SDSPI_PORT->DR & 0xFF;
}

//==============================================================================
/**
 * @brief Function send byte by SPI peripheral
 *
 * @param[in] out       data to send
 *
 * @return received byte
 */
//==============================================================================
static u8_t spi_transmit(u8_t out)
{
        spi_send_data(out);
        while (!spi_is_rx_buffer_not_empty());
        return spi_get_data();
}

//==============================================================================
/**
 * @brief Function wait for card ready
 *
 * @return card response
 */
//==============================================================================
static u8_t card_wait_ready(void)
{
        spi_transmit(0xFF);

        u8_t    response;
        timer_t timer = timer_reset();
        while ((response = spi_transmit(0xFF)) != 0xFF && timer_is_not_expired(timer, SDSPI_TIMEOUT));

        return response;
}

//==============================================================================
/**
 * @brief Function transmit command to card
 *
 * @param[in] hdl       partition handler
 * @param[in] cmd       card command
 * @param[in] arg       command's argument
 */
//==============================================================================
static u8_t card_send_cmd(sdpart_t *hdl, u8_t cmd, u32_t arg)
{
        u8_t response;

        /* ACMD<n> is the command sequence of CMD55-CMD<n> */
        if (cmd & 0x80) {
                cmd &= 0x7F;
                response = card_send_cmd(hdl, CMD55, 0);
                if (response > 1)
                        return response;
        }

        /* select the card and wait for ready */
        spi_deselect_card();
        spi_select_card();

        if (card_wait_ready() != 0xFF) {
                errno = EIO;
                return 0xFF;
        }

        /* send command packet */
        spi_transmit(cmd);                    /* Start + Command index */
        spi_transmit(arg >> 24);              /* Argument[31..24]      */
        spi_transmit(arg >> 16);              /* Argument[23..16]      */
        spi_transmit(arg >> 8);               /* Argument[15..8]       */
        spi_transmit(arg);

        if (cmd == CMD0)
                spi_transmit(0x95);           /* Valid CRC for CMD0(0) */
        else if (cmd == CMD8)
                spi_transmit(0x87);           /* Valid CRC for CMD8(0x1AA) */
        else
                spi_transmit(0x01);           /* Dummy CRC + Stop */

        /* receive command response */
        if (cmd == CMD12)
                spi_transmit(0xFF);           /* Skip a stuff byte when stop reading */

        /* wait for a valid response in timeout of 10 attempts */
        int n = 10;
        do {
                response = spi_transmit(0xFF);
        } while ((response & 0x80) && --n);

        return response;
}

//==============================================================================
/**
 * @brief Function receive data block
 *
 * @param[out] *buff            data buffer (sector size)
 *
 * @retval true if success
 * @retval false if error
 */
//==============================================================================
static bool card_receive_data_block(u8_t *buff)
{
        u8_t    token;
        timer_t timer = timer_reset();
        while ((token = spi_transmit(0xFF)) == 0xFF && timer_is_not_expired(timer, SDSPI_TIMEOUT));

        if (token != 0xFE) {
                errno = EIO;
                return false;
        }

#if (SDSPI_ENABLE_DMA != 0)
        SDSPI_DMA_RX_CHANNEL->CPAR  = (u32_t)&SDSPI_PORT->DR;
        SDSPI_DMA_RX_CHANNEL->CMAR  = (u32_t)buff;
        SDSPI_DMA_RX_CHANNEL->CNDTR = SECTOR_SIZE;
        SDSPI_DMA_RX_CHANNEL->CCR   = DMA_CCR1_MINC | DMA_CCR1_TCIE | DMA_CCR1_EN;
        NVIC_EnableIRQ(SDSPI_DMA_IRQ_NUMBER);

        u16_t dummy = 0xFFFF;
        SDSPI_DMA_TX_CHANNEL->CPAR  = (u32_t)&SDSPI_PORT->DR;
        SDSPI_DMA_TX_CHANNEL->CMAR  = (u32_t)&dummy;
        SDSPI_DMA_TX_CHANNEL->CNDTR = SECTOR_SIZE;
        SDSPI_DMA_TX_CHANNEL->CCR   = DMA_CCR1_DIR | DMA_CCR1_EN;

        sdspi_ctrl->DMA_tansaction_finished = false;

