devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
                        /* set R/W block length to 512 */
                        if ( !timer_is_expired(timer, SDSPI_TIMEOUT)
                           || card_send_cmd(hdl, CMD16, SECTOR_SIZE) != 0) {

                                sdspi_ctrl->card_type = 0;
                        }
                }

                if (!timer_is_expired(timer, SDSPI_TIMEOUT)) {
                        sdspi_ctrl->card_initialized = true;
                }
        }

        /* size info */
        for (int i = _SDSPI_FULL_VOLUME; i <= _SDSPI_PARTITION_4; i++) {
                if (sdspi_ctrl->part[i]) {
                        sdspi_ctrl->part[i]->size = 0;
                }
        }

        if (card_send_cmd(hdl, CMD9, 0) == 0) {
                u8_t csd[16];
                u8_t token;

                timer_t timer = timer_reset();
                while ((token = spi_transmit(0xFF)) == 0xFF && timer_is_not_expired(timer, SDSPI_TIMEOUT));

                if (token == 0xFE) {
                        u8_t *ptr = &csd[0];
                        for (int i = 0; i < 4; i++) {
                                *ptr++ = spi_transmit(0xFF);
                                *ptr++ = spi_transmit(0xFF);
                                *ptr++ = spi_transmit(0xFF);
                                *ptr++ = spi_transmit(0xFF);
                        }
                        spi_transmit(0xFF);
                        spi_transmit(0xFF);

                        /* SDC version 2.00 */
                        u32_t size;
                        if ((csd[0] >> 6) == 1) {
                                u32_t csize = csd[9] + ((u16_t)csd[8] << 8) + 1;
                                size        = csize << 10;
                        } else { /* SDC version 1.XX or MMC*/
                                u32_t n     = (csd[5] & 15) + ((csd[10] & 128) >> 7) + ((csd[9] & 3) << 1) + 2;
                                u32_t csize = (csd[8] >> 6) + ((u16_t)csd[7] << 2) + ((u16_t)(csd[6] & 3) << 10) + 1;
                                size        = csize << (n - 9);
                        }

                        if (sdspi_ctrl->part[_SDSPI_FULL_VOLUME]) {
                                sdspi_ctrl->part[_SDSPI_FULL_VOLUME]->size = size;
                        }
                }
        }

        spi_deselect_card();
        spi_transmit(0xFF);

        if (sdspi_ctrl->card_initialized == false) {
                return STD_RET_ERROR;
        } else {
                return STD_RET_OK;
        }
}

//==============================================================================
/**
 * @brief Read data from card
 *
 * @param[in]  *hdl             driver's memory handle
 * @param[out] *dst             destination
 * @param[in]   count           bytes to read
 * @param[in]   lseek           file index
 *
 * @retval number of read bytes
 */
//==============================================================================
static ssize_t card_read(sdpart_t *hdl, u8_t *dst, size_t count, u64_t lseek)
{
        if (sdspi_ctrl->card_initialized == false) {
                errno = EIO;
                return -1;
        }

        /* whole sector(s) read */
        ssize_t n = 0;
        if ((count % SECTOR_SIZE == 0) && (lseek % SECTOR_SIZE == 0)) {

                n  = card_read_whole_sectors(hdl, dst, count / SECTOR_SIZE, lseek);
                n *= SECTOR_SIZE;

        } else {
                n  = card_read_partial_sectors(hdl, dst, count, lseek);
        }

        spi_deselect_card();
        spi_transmit(0xFF);

        return n;
}

//==============================================================================
/**
 * @brief Write data to card
 *
 * @param[in] *hdl              driver's memory handle
 * @param[in] *src              source
 * @param[in]  count            bytes to write
 * @param[in]  lseek            file index
 *
 * @retval number of written bytes
 */
//==============================================================================
static ssize_t card_write(sdpart_t *hdl, const u8_t *src, size_t count, u64_t lseek)
{
        if (sdspi_ctrl->card_initialized == false) {
                errno = EIO;
                return -1;
        }

        /* whole sector(s) read */
        ssize_t n = 0;
        if ((count % SECTOR_SIZE == 0) && (lseek % SECTOR_SIZE == 0)) {

                n  = card_write_whole_sectors(hdl, src, count / SECTOR_SIZE, lseek);
                n *= SECTOR_SIZE;

        } else {
                n  = card_write_partial_sectors(hdl, src, count, lseek);
        }

        spi_deselect_card();
        spi_transmit(0xFF);

        return n;
}

//==============================================================================
/**
 * @brief Function load 32b data from selected buffer and offset
 *
 * @param buff                  buffer
 * @param offset                variable offset
 *
 * @return 32-bit value
 */
//==============================================================================
static u32_t load_u32(u8_t *buff, u16_t offset)
{
        return (u32_t)( ((u32_t)buff[offset + 0] <<  0)
                      | ((u32_t)buff[offset + 1] <<  8)
                      | ((u32_t)buff[offset + 2] << 16)
                      | ((u32_t)buff[offset + 3] << 24) );
}

//==============================================================================
/**
 * @brief Function load 16b data from selected buffer and offset
 *
 * @param buff                  buffer
 * @param offset                variable offset
 *
 * @return 16-bit value
 */
//==============================================================================
static u16_t load_u16(u8_t *buff, u16_t offset)
{
        return (u16_t)(((u16_t)buff[offset + 0]) | ((u16_t)buff[offset + 1] << 8));
}

//==============================================================================
/**
 * @brief Function gets boot signature
 *
 * @param sector                buffer with sector
 *
 * @return boot signature
 */
//==============================================================================
static u16_t mbr_get_boot_signature(u8_t *sector)
{
     return load_u16(sector, MBR_BOOT_SIGNATURE_OFFSET);
}

//==============================================================================
/**
 * @brief Function return partition first LBA sector number
 *
 * @param partition             partition number (1 - 4)
 * @param sector                buffer with sector
 *
 * @return first LBA sector number
 */
//==============================================================================
static u32_t mbr_get_partition_first_LBA_sector(int partition, u8_t *sector)
{
        switch (partition) {
        case 1 : return load_u32(sector, MBR_PARTITION_1_ENTRY_OFFSET + MBR_PARITION_ENTRY_LBA_FIRST_ADDR_OFFSET);
        case 2 : return load_u32(sector, MBR_PARTITION_2_ENTRY_OFFSET + MBR_PARITION_ENTRY_LBA_FIRST_ADDR_OFFSET);
        case 3 : return load_u32(sector, MBR_PARTITION_3_ENTRY_OFFSET + MBR_PARITION_ENTRY_LBA_FIRST_ADDR_OFFSET);
        case 4 : return load_u32(sector, MBR_PARTITION_4_ENTRY_OFFSET + MBR_PARITION_ENTRY_LBA_FIRST_ADDR_OFFSET);
        default: return 0;
        }
}

//==============================================================================
/**
 * @brief Function return partition number of sectors
 *
 * @param partition             partition number (1 - 4)
 * @param sector                buffer with sector
 *
 * @return number of partition sectors
 */
//==============================================================================
static u32_t mbr_get_partition_number_of_sectors(int partition, u8_t *sector)
{
        switch (partition) {
        case 1 : return load_u32(sector, MBR_PARTITION_1_ENTRY_OFFSET + MBR_PARITION_ENTRY_NUM_OF_SECTORS_OFFSET);
        case 2 : return load_u32(sector, MBR_PARTITION_2_ENTRY_OFFSET + MBR_PARITION_ENTRY_NUM_OF_SECTORS_OFFSET);
        case 3 : return load_u32(sector, MBR_PARTITION_3_ENTRY_OFFSET + MBR_PARITION_ENTRY_NUM_OF_SECTORS_OFFSET);
        case 4 : return load_u32(sector, MBR_PARTITION_4_ENTRY_OFFSET + MBR_PARITION_ENTRY_NUM_OF_SECTORS_OFFSET);
        default: return 0;
        }


